src/Enums/цур_СтатусыРоли/цур_СтатусыРоли.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>цур_СтатусыРоли</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Актуальна</name>
  </enumValues>
  <enumValues>
    <name>Устарела</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/цур_Роли/цур_Роли.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>цур_Роли</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.цур_ИнформационныеБазы</owners>
  <attributes>
    <name>ИмяРолиВКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРоли</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УстанавливатьДляНовыхОбъектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УстанавливатьДляРеквизитовПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НезависимыеПраваПодчиненных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.цур_СтатусыРоли</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильДоступа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешСоставаРоли</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/цур_ОбновлениеРолейСервер/Module.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Точка входа регламентного задания. Находит роли со статусом "Актуальна"
// и заполненным профилем доступа, вычисляет текущий хеш профиля и
// перезаполняет права при изменении состава. Если хотя бы одна роль
// обновилась — запускает перегенерацию CFE.
//
Процедура ВыполнитьОбновление() Экспорт

	РолиДляОбновления = НайтиАктуальныеРолиСПрофилем();

	Если РолиДляОбновления.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	МассивОбновленныхРолей = Новый Массив;

	Для Каждого СтрокаРоли Из РолиДляОбновления Цикл

		НовыйХеш = ВычислитьХешПрофиля(СтрокаРоли.ПрофильДоступа);

		Если НовыйХеш = СтрокаРоли.ХешСоставаРоли Тогда
			Продолжить;
		КонецЕсли;

		цур_МодельРолейСервер.ЗаполнитьПраваИзПрофиля(
			СтрокаРоли.Ссылка,
			СтрокаРоли.ПрофильДоступа);

		ОбновитьХешРоли(СтрокаРоли.Ссылка, НовыйХеш);

		МассивОбновленныхРолей.Добавить(СтрокаРоли.Ссылка);

	КонецЦикла;

	Если МассивОбновленныхРолей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ГенераторРолей = Обработки.цур_ГенераторРолей.Создать();
	ГенераторРолей.Сгенерировать(МассивОбновленныхРолей);

КонецПроцедуры

// Вычисляет MD5-хеш от отсортированного списка ролей профиля.
// Если подсистема управления доступом (справочник ПрофилиГруппДоступа)
// недоступна — возвращает пустую строку.
//
// Параметры:
//  ИмяПрофиля - Строка - наименование профиля доступа
//
// Возвращаемое значение:
//  Строка - MD5-хеш (32 символа HEX) или пустая строка
//
Функция ВычислитьХешПрофиля(ИмяПрофиля) Экспорт

	МассивРолей = ПолучитьИменаРолейПрофиля(ИмяПрофиля);

	Если МассивРолей.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;

	МассивРолей.Сортировать();

	СтрокаДляХеша = СтрСоединить(МассивРолей, ";");

	ХешированиеМД5 = Новый ХешированиеДанных(ХешФункция.MD5);
	ХешированиеМД5.Добавить(СтрокаДляХеша);

	Возврат СтрЗаменить(XMLСтрока(ХешированиеМД5.ХешСумма), " ", "");

КонецФункции

// Записывает новое значение хеша в реквизит ХешСоставаРоли справочника.
//
// Параметры:
//  СсылкаРоли - СправочникСсылка.цур_Роли - ссылка на элемент справочника
//  НовыйХеш  - Строка - новое значение хеша (MD5, 32 символа)
//
Процедура ОбновитьХешРоли(СсылкаРоли, НовыйХеш) Экспорт

	ОбъектРоли = СсылкаРоли.ПолучитьОбъект();
	ОбъектРоли.ХешСоставаРоли = НовыйХеш;
	ОбъектРоли.Записать();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает таблицу значений с ролями, имеющими статус "Актуальна"
// и непустой реквизит ПрофильДоступа.
//
// Возвращаемое значение:
//  РезультатЗапроса.Выборка - колонки: Ссылка, ПрофильДоступа, ХешСоставаРоли
//
Функция НайтиАктуальныеРолиСПрофилем()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	цур_Роли.Ссылка          КАК Ссылка,
	|	цур_Роли.ПрофильДоступа  КАК ПрофильДоступа,
	|	цур_Роли.ХешСоставаРоли  КАК ХешСоставаРоли
	|ИЗ
	|	Справочник.цур_Роли КАК цур_Роли
	|ГДЕ
	|	цур_Роли.Статус           = &СтатусАктуальна
	|	И цур_Роли.ПрофильДоступа <> """"
	|	И НЕ цур_Роли.ПометкаУдаления";
	Запрос.УстановитьПараметр("СтатусАктуальна", Перечисления.цур_СтатусыРоли.Актуальна);

	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();

КонецФункции

// Получает массив имён ролей для переданного профиля.
// При наличии справочника ПрофилиГруппДоступа читает роли из него.
// Иначе трактует ИмяПрофиля как имя роли конфигурации.
//
// Параметры:
//  ИмяПрофиля - Строка - наименование профиля доступа
//
// Возвращаемое значение:
//  Массив - массив строк с именами ролей конфигурации
//
Функция ПолучитьИменаРолейПрофиля(ИмяПрофиля)

	Если Метаданные.НайтиПоПолномуИмени("Справочник.ПрофилиГруппДоступа") <> Неопределено Тогда
		Возврат ПолучитьИменаРолейИзСправочника(ИмяПрофиля);
	КонецЕсли;

	// Подсистема управления доступом отсутствует:
	// ИмяПрофиля трактуется как имя роли конфигурации
	МассивРолей = Новый Массив;
	Если Метаданные.Роли.Найти(ИмяПрофиля) <> Неопределено Тогда
		МассивРолей.Добавить(ИмяПрофиля);
	КонецЕсли;

	Возврат МассивРолей;

КонецФункции

// Читает состав ролей профиля из справочника ПрофилиГруппДоступа.
//
// Параметры:
//  ИмяПрофиля - Строка - наименование профиля доступа
//
// Возвращаемое значение:
//  Массив - массив строк с именами ролей конфигурации
//
Функция ПолучитьИменаРолейИзСправочника(ИмяПрофиля)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РолиПрофиля.Роль КАК ИмяРоли
	|ИЗ
	|	Справочник.ПрофилиГруппДоступа.Роли КАК РолиПрофиля
	|ГДЕ
	|	РолиПрофиля.Ссылка.Наименование = &ИмяПрофиля";
	Запрос.УстановитьПараметр("ИмяПрофиля", ИмяПрофиля);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка          = РезультатЗапроса.Выбрать();

	МассивРолей = Новый Массив;
	Пока Выборка.Следующий() Цикл
		МассивРолей.Добавить(Выборка.ИмяРоли);
	КонецЦикла;

	Возврат МассивРолей;

КонецФункции

#КонецОбласти

#КонецЕсли
